## Plan Result (prod_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 64 to change, 1 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00landingprod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta002-prod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta002-prod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.adf.azure.com&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.database.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.datafactory.azure.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dev.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.servicebus.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.sql.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_public_ip.legacy_pip[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;logic&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;main&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace.this
  * module.logic[&#34;00&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;00&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_network_interface.vm_nic
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest00-integration-databricks001-prod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;landing-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;landing-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_eventhub_namespace.this will be updated in-place
  ~ resource "azurerm_eventhub_namespace" "this" {
        id                                        = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-prod"
        name                                      = "ingest00-integration-eventHubNamespace001-prod"
      ~ tags                                      = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].azurerm_log_analytics_workspace.this will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                                      = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-prod"
        name                                    = "ingest00-logAnalytics001-prod"
      ~ tags                                    = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (15 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.adf.azure.com"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com/virtualNetworkLinks/ingest00-adf-data-landing-link-prod"
        name                  = "ingest00-adf-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.blob.core.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/ingest00-blob-data-landing-link-prod"
        name                  = "ingest00-blob-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.database.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net/virtualNetworkLinks/ingest00-database-data-landing-link-prod"
        name                  = "ingest00-database-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.datafactory.azure.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net/virtualNetworkLinks/ingest00-datafactory-data-landing-link-prod"
        name                  = "ingest00-datafactory-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dev.azuresynapse.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net/virtualNetworkLinks/ingest00-dev-data-landing-link-prod"
        name                  = "ingest00-dev-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dfs.core.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/ingest00-dfs-data-landing-link-prod"
        name                  = "ingest00-dfs-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.mysql.database.azure.com"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com/virtualNetworkLinks/ingest00-mysql-data-landing-link-prod"
        name                  = "ingest00-mysql-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.servicebus.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net/virtualNetworkLinks/ingest00-servicebus-data-landing-link-prod"
        name                  = "ingest00-servicebus-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.sql.azuresynapse.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net/virtualNetworkLinks/ingest00-sql-data-landing-link-prod"
        name                  = "ingest00-sql-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.vaultcore.azure.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/ingest00-vaultcore-data-landing-link-prod"
        name                  = "ingest00-vaultcore-data-landing-link-prod"
      ~ tags                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_public_ip.legacy_pip["legacy-sql"] will be updated in-place
  ~ resource "azurerm_public_ip" "legacy_pip" {
        id                      = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/publicIPAddresses/ingest00-legacy-sql-pip-prod"
        name                    = "ingest00-legacy-sql-pip-prod"
      ~ tags                    = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (12 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["logic"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-logic-prod"
        name       = "ingest00-logic-prod"
      ~ tags       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["main"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod"
        name       = "ingest00-main-prod"
      ~ tags       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["network"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod"
        name       = "ingest00-network-prod"
      ~ tags       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_synapse_workspace.this will be updated in-place
  ~ resource "azurerm_synapse_workspace" "this" {
        id                                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-prod"
        name                                 = "ingest00-product-synapse001-prod"
      ~ tags                                 = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_logic_app_standard.this will be updated in-place
  ~ resource "azurerm_logic_app_standard" "this" {
      ~ app_settings                   = {
          ~ "FUNCTIONS_WORKER_RUNTIME"          = "dotnet" -> "node"
            # (8 unchanged elements hidden)
        }
        id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-logic-prod/providers/Microsoft.Web/sites/ingest00-logic-prod"
        name                           = "ingest00-logic-prod"
        tags                           = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_resource_group_template_deployment.sqlConn will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "sqlConn" {
        id                       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-logic-prod/providers/Microsoft.Resources/deployments/logicapp-sql-conn-deployment"
        name                     = "logicapp-sql-conn-deployment"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = jsonencode(
          ~ {
              - location   = {
                  - value = "uksouth"
                }
                # (1 unchanged attribute hidden)
            }
        )
        tags                     = {}
        # (5 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/networkInterfaces/ingest00-legacy-sql-nic-prod"
        name                           = "ingest00-legacy-sql-nic-prod"
      ~ tags                           = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (17 unchanged attributes hidden)

        # (1 unchanged blo

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ata-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00rawprod"
        name                               = "ingest00rawprod"
      ~ tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00workspaceprod"
        name                               = "ingest00workspaceprod"
      ~ tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-curated-blob-pe-prod"
        name                          = "ingest00-curated-blob-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-curated-dfs-pe-prod"
        name                          = "ingest00-curated-dfs-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["external-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-external-blob-pe-prod"
        name                          = "ingest00-external-blob-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["external-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-external-dfs-pe-prod"
        name                          = "ingest00-external-dfs-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["landing-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-landing-blob-pe-prod"
        name                          = "ingest00-landing-blob-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["landing-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-landing-dfs-pe-prod"
        name                          = "ingest00-landing-dfs-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-raw-blob-pe-prod"
        name                          = "ingest00-raw-blob-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-raw-dfs-pe-prod"
        name                          = "ingest00-raw-dfs-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-workspace-blob-pe-prod"
        name                          = "ingest00-workspace-blob-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-workspace-dfs-pe-prod"
        name                          = "ingest00-workspace-dfs-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["dev"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-prod"
        name                          = "ingest00-product-synapse001-dev-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["sql"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-prod"
        name                          = "ingest00-product-synapse001-sql-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-prod"
        name                          = "ingest00-product-synapse001-sqlOnDemand-pe-prod"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-prod"
        name                                              = "ingest00-shir001-vmss-prod"
      ~ tags                                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (34 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 11 to add, 64 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Target":"prod_landing - TerraformPlanApply","Vars":{}} -->